In [1]:
import pandas as pd

In [3]:
frutas = {'Nomes': ['Maçã', 'Uva', 'Melão', 'Melancia', 'Morango', 'Tangerina'],
          'Região de Origem': ['Ásia Central', 'Oriente Médio', 'Sudoeste da Ásia', 'Nordeste da África', 'Europa', 'Sudeste da Ásia']}
df = pd.DataFrame(frutas)

In [10]:
origem_asiática = df["Região de Origem"].str.contains("Ásia")
df[origem_asiática]

       Nomes  Região de Origem
0       Maçã      Ásia Central
2      Melão  Sudoeste da Ásia
5  Tangerina   Sudeste da Ásia

In [13]:
começam_com_M = df["Nomes"].str.startswith("M")
df[começam_com_M]

      Nomes    Região de Origem
0      Maçã        Ásia Central
2     Melão    Sudoeste da Ásia
3  Melancia  Nordeste da África
4   Morango              Europa

In [17]:
terminam_com_a = df["Nomes"].str.endswith("a")
df[terminam_com_a]

       Nomes    Região de Origem
1        Uva       Oriente Médio
3   Melancia  Nordeste da África
5  Tangerina     Sudeste da Ásia

In [29]:
álbuns = {'Nome': ['The Tipping Point', 'The New Danger', 'The Eminem Show', 'When I Get Home', 'Graduation'],
          'Artista': ['The Roots', 'Mos Def', 'Eminem', 'Solange', 'Kanye West'],
          'Ano': [2004, 2004, 2002, 2019, 2007]}
álbuns_df = pd.DataFrame(álbuns).sort_values("Nome")

In [30]:
álbuns_df

                Nome     Artista   Ano
4         Graduation  Kanye West  2007
2    The Eminem Show      Eminem  2002
1     The New Danger     Mos Def  2004
0  The Tipping Point   The Roots  2004
3    When I Get Home     Solange  2019

In [32]:
álbuns_df["Nome"].str.split(" ").str.get(0).value_counts()

Nome
The           3
Graduation    1
When          1
Name: count, dtype: int64